## Yoshops Data Science Internship
## Week 1 Task 3 : Python Program for formatting Data in Excel Sheet

## <u>Name</u> : ADVAIT GURUNATH CHAVAN
## <u>Email</u> : advaitchavan135@gmail.com , advaitchavan.yoshops@gmail.com
## <u>Contact No</u> : +91 70214 55852

#### Importing the necessary dependencies

In [1]:
import xlsxwriter as xl
import pandas as pd

#### Creating a new excel workbook using the 'Workbook' function of the xlsxwriter module

In [2]:
excel_book = xl.Workbook('Yoshops_Data_Science_Intern_Week_1_Task_3_Before.xlsx')

#### Using the 'add_worksheet' function so as to create a new sheet in the workbook created above

In [3]:
excel_sheet = excel_book.add_worksheet()

#### Using the 'write' function so as to fill the created excel sheet with values based on the cell number

In [4]:
excel_sheet.write('A1','Variable')
excel_sheet.write('B1','Value')
excel_sheet.write('A2','Name: ')
excel_sheet.write('B2','ADVAIT GURUNATH CHAVAN')
excel_sheet.write('A3','Yoshops')
excel_sheet.write('B3','Data Science Intern')
excel_sheet.write('A4','Week: ')
excel_sheet.write('B4','1')
excel_sheet.write('A5','Task:')
excel_sheet.write('B5','1')

0

In [5]:
### Adding another sheet and inserting values to them
excel_sheet_1 = excel_book.add_worksheet()
excel_sheet_1.write('A1','Variable')
excel_sheet_1.write('B1','Value')
excel_sheet_1.write('A2','Name: ')
excel_sheet_1.write('B2','ADVAIT GURUNATH CHAVAN')
excel_sheet_1.write('A3','Yoshops')
excel_sheet_1.write('B3','Data Science Intern')
excel_sheet_1.write('A4','Week: ')
excel_sheet_1.write('B4','1')
excel_sheet_1.write('A5','Task:')
excel_sheet_1.write('B5','1')

0

In [6]:
excel_book.close()

#### Using 'read_excel' function of pandas to view the first excel sheet created above

In [7]:
excel_sheet_view = pd.read_excel('Yoshops_Data_Science_Intern_Week_1_Task_3_Before.xlsx',sheet_name=0)

In [8]:
excel_sheet_view

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                        1
3    Task:                       1

#### Modifying the contents of the first excel sheet

In [9]:
excel_sheet_view['Value'][3]

'1'

In [10]:
excel_sheet_view['Value'][3] = '3'

In [11]:
excel_sheet_view['Value'][3]

'3'

#### First Excel sheet after modifying/formatting the contents

In [12]:
excel_sheet_view

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                        1
3    Task:                       3

#### Using 'read_excel' function of pandas to view the second excel sheet created above

In [13]:
excel_sheet_view_2 = pd.read_excel('Yoshops_Data_Science_Intern_Week_1_Task_3_Before.xlsx',sheet_name=1)

In [14]:
excel_sheet_view_2

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                        1
3    Task:                       1

#### Modifying the contents of the second excel sheet

In [15]:
excel_sheet_view_2['Value'][3]

'1'

In [16]:
excel_sheet_view_2['Value'][3] = 'Three'

In [17]:
excel_sheet_view_2['Value'][3]

'Three'

In [18]:
excel_sheet_view_2

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                        1
3    Task:                   Three

In [19]:
excel_sheet_view_2['Value'][1]

'Data Science Intern'

In [20]:
excel_sheet_view_2['Value'][2]

'1'

In [21]:
excel_sheet_view_2['Value'][3] = 'Three'

In [22]:
excel_sheet_view_2['Value'][3]

'Three'

In [23]:
excel_sheet_view_2['Value'][2] = 'One'

In [24]:
excel_sheet_view_2['Value'][2]

'One'

In [25]:
excel_sheet_view_2['Value'][3]

'Three'

In [26]:
excel_sheet_view_2

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                      One
3    Task:                   Three

#### Concating the updated and Formated Excel sheets/files

In [31]:
new_excel = pd.concat([excel_sheet_view,excel_sheet_view_2], axis=1)

In [32]:
new_excel

  Variable                   Value Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern  Yoshops     Data Science Intern
2   Week:                        1   Week:                      One
3    Task:                       3    Task:                   Three

#### Using 'ExcelWriter' function of pandas to store the above sheets in a new workbook

In [34]:
with pd.ExcelWriter('Yoshops_Data_Science_Intern_Week_1_Task_3_After.xlsx') as writer:
    excel_sheet_view.to_excel(writer, sheet_name="Updated sheet 1", index=False)
    excel_sheet_view_2.to_excel(writer, sheet_name="Updated sheet 2", index=False)
    new_excel.to_excel(writer, sheet_name="Concated or Combined Sheet", index=False)

#### Viewing the Updated or Formatted excel workbook

In [35]:
updated_sheet_1 = pd.read_excel('Yoshops_Data_Science_Intern_Week_1_Task_3_After.xlsx',sheet_name='Updated sheet 1')

In [36]:
updated_sheet_1

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                        1
3    Task:                       3

In [37]:
updated_sheet_2 = pd.read_excel('Yoshops_Data_Science_Intern_Week_1_Task_3_After.xlsx',sheet_name='Updated sheet 2')

In [39]:
updated_sheet_2

  Variable                   Value
0   Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern
2   Week:                      One
3    Task:                   Three

In [41]:
updated_concated_sheet = pd.read_excel('Yoshops_Data_Science_Intern_Week_1_Task_3_After.xlsx',sheet_name='Concated or Combined Sheet')

In [42]:
updated_concated_sheet

  Variable                   Value Variable.1                 Value.1
0   Name:   ADVAIT GURUNATH CHAVAN     Name:   ADVAIT GURUNATH CHAVAN
1  Yoshops     Data Science Intern    Yoshops     Data Science Intern
2   Week:                        1     Week:                      One
3    Task:                       3      Task:                   Three